; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-2 - location
	p0-4 - location
	p1-4 - location
	p2-5 - location
	p3-1 - location
	p4-3 - location
	p4-5 - location
	p5-0 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s5)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at package1 s5)
	(at package2 s5)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s5)
	(at truck1 s0)
	(at truck2 s5)
	(at truck4 s4)
	(at package1 s4)
	(at package2 s4)
	))


)

; plan
1. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 2 of 9
2. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 2 of 9
3. (walk driver2 s0 p0-4)
   deleted: (at driver2 s0)
   added: (at driver2 p0-4)
   goals met: 2 of 9
4. (walk driver2 p0-4 s4)
   deleted: (at driver2 p0-4)
   added: (at driver2 s4)
   goals met: 3 of 9
5. (walk driver2 s4 p4-3)
   deleted: (at driver2 s4)
   added: (at driver2 p4-3)
   goals met: 2 of 9
6. (walk driver2 p4-3 s3)
   deleted: (at driver2 p4-3)
   added: (at driver2 s3)
   goals met: 2 of 9
7. (walk driver1 s4 p1-4)
   deleted: (at driver1 s4)
   added: (at driver1 p1-4)
   goals met: 2 of 9
8. (walk driver1 p1-4 s1)
   deleted: (at driver1 p1-4)
   added: (at driver1 s1)
   goals met: 2 of 9
9. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 9
10. (drive-truck truck4 s3 s5 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   goals met: 1 of 9
11. (load-truck package2 truck4 s5)
   deleted: (at package2 s5)
   added: (in package2 truck4)
   goals met: 1 of 9
12. (load-truck package1 truck4 s5)
   deleted: (at package1 s5)
   added: (in package1 truck4)
   goals met: 1 of 9
13. (drive-truck truck4 s5 s0 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   goals met: 1 of 9
14. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 2 of 9
15. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 9
16. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 9
17. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 2 of 9
18. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 3 of 9
19. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 4 of 9
20. (drive-truck truck2 s3 s5 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 5 of 9
21. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 5 of 9
22. (unload-truck package1 truck4 s4)
   deleted: (in package1 truck4)
   added: (at package1 s4)
   goals met: 6 of 9
23. (unload-truck package2 truck4 s4)
   deleted: (in package2 truck4)
   added: (at package2 s4)
   goals met: 7 of 9
24. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 7 of 9
25. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   goals met: 8 of 9
26. (walk driver3 s4 p4-3)
   deleted: (at driver3 s4)
   added: (at driver3 p4-3)
   goals met: 8 of 9
27. (walk driver3 p4-3 s3)
   deleted: (at driver3 p4-3)
   added: (at driver3 s3)
   goals met: 9 of 9
